orgs/2024-02-21-all-in-emacs-blog.org
#+TITLE: 百般武艺，此乃 Emacs （一）：用 Emacs 写博客
#+DATE: 2024-02-21
#+BLOGTAGS: Emacs Literate-Programing

#+begin_abstract
本文简要介绍了如何使用 Emacs 来生成静态博客网站。主要分为三个模块：
1. 博客生成
2. RSS 生成
3. 文学编程网页导出
#+end_abstract

* 使用 ox-publish.el 来生成博客
** 为什么选择 ox-publish.el
在 Emacs 里写博客的方案有很多，比如说 Org + Hugo 、Markdown/Org + Jekyll 等等。
它们各有各的优点，但这不是本文的讨论重点，有兴趣的读者可以自行查阅。我之所以使用
ox-publish.el ，主要有以下几点原因：
*** 兼容性
我基本上所有的写作活动都是在 Org-mode 里完成的，对 Org-mode 有着比较深度的自定义
配置，因此希望能直接基于 org 文件来生成博客。Hugo 虽然号称能够解析 org 格式，
但是对于自定义的格式就无能为力了[fn:1]，比如说[[https://orgmode.org/manual/Adding-Hyperlink-Types.html][自定义的链接格式]]。而 ox-publish.el 采用
的是 Org-mode 自带的导出功能，只需要你自己写好相关格式的导出方式，便可以完美地支
持任何 org 文件。
*** 内置
ox-publish.el 中的 =ox= 是 =org-export= 的缩写，从名字就能看出来它是 Org-mode 导出功
能的一个模块。因此可以和 Org-mode 的其他功能功能无缝整合，任何需求都能较为简单地
实现。内置的另一个好处是我不用担心这个项目后续的发展，只要 Org-mode 还能用，
ox-publish.el 就能用。
*** 可拓展性
Org-mode 的 =ox= 模块提供了很多 hook ，比如能够分别在导出前后修改原始文本（的复制）和
导出文本。这基本上满足我的绝大部分个性化需求，实在不行我也可以通过 [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Advising-Functions.html][advice]] 来修改原
有函数，总之可扩展性非常好强。
** 博客结构
:PROPERTIES:
:CUSTOM_ID: blog-structure
:END:
首先介绍一下博客的基本结构

#+begin_example
  ├── articles/
  ├── config.html
  ├── css/
  │   └── style.css
  ├── index.html
  ├── rss.xml
  └── scripts/
      └── script.js
      └── toc.js
#+end_example

- articles :: 此文件夹包含所有的博客文章
- css :: 此文件夹包含所有的 CSS 文件
- script :: 此文件夹包含所有的 JS 文件
- config.html :: 我的 Emacs 文学编程配置
- index.html :: 博客主页
- rss.xml :: RSS 订阅
