articles/2024-02-21-all-in-emacs-blog.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-03-01 Fri 23:58 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>百般武艺，此乃 Emacs （一）：用 Emacs 写博客</title>
<meta name="author" content="Eli Qian" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="/assets/favion.png">
<link rel="stylesheet" type="text/css" href="/css/styles.css"/>
<link rel="stylesheet" type="text/css" href="/css/htmlize.css" />
<link href='https://unpkg.com/boxicons@2.1.4/css/boxicons.min.css' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<nav class="nav">
  <a href="/index.html" class="button">Home</a>
  <a href="/config.html" class="button">Literate Emacs Config</a>
  <a href="/rss.xml" class="button">RSS</a>
</nav>
<hr>
</div>
<div id="content" class="content">
<header>
<h1 class="title">百般武艺，此乃 Emacs （一）：用 Emacs 写博客</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#使用-ox-publish.el-来生成博客">1. 使用 ox-publish.el 来生成博客</a>
<ul>
<li><a href="#为什么选择-ox-publish.el">1.1. 为什么选择 ox-publish.el</a>
<ul>
<li><a href="#兼容性">1.1.1. 兼容性</a></li>
<li><a href="#内置">1.1.2. 内置</a></li>
<li><a href="#可拓展性">1.1.3. 可拓展性</a></li>
</ul>
</li>
<li><a href="#blog-structure">1.2. 博客结构</a></li>
<li><a href="#基本配置">1.3. 基本配置</a>
<ul>
<li><a href="#杂项部分">1.3.1. 杂项部分</a></li>
<li><a href="#HTML-部分">1.3.2. HTML 部分</a></li>
<li><a href="#sitemap-部分">1.3.3. sitemap 部分</a></li>
<li><a href="#本章总结">1.3.4. 本章总结</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#RSS-生成">2. RSS 生成</a></li>
<li><a href="#Org-文学编程网页导出">3. Org 文学编程网页导出</a></li>
<li><a href="#总结">4. 总结</a></li>
</ul>
</div>
</nav>
<div class="abstract">
本文简要介绍了如何使用 Emacs 来生成静态博客网站。主要分为三个模块：

<ol class="org-ol">
<li>博客生成</li>
<li>RSS 生成</li>
<li>文学编程网页导出</li>
</ol>

</div>

<div id="outline-container-使用-ox-publish.el-来生成博客" class="outline-2">
<h2 id="使用-ox-publish.el-来生成博客"><span class="section-number-2">1.</span> 使用 ox-publish.el 来生成博客</h2>
<div class="outline-text-2" id="text-使用-ox-publish.el-来生成博客">
</div>
<div id="outline-container-为什么选择-ox-publish.el" class="outline-3">
<h3 id="为什么选择-ox-publish.el"><span class="section-number-3">1.1.</span> 为什么选择 ox-publish.el</h3>
<div class="outline-text-3" id="text-为什么选择-ox-publish.el">
<p>
在 Emacs 里写博客的方案有很多，比如说 Org + Hugo 、Markdown/Org + Jekyll 等等。它们各有各的优点，但这不是本文的讨论重点，有兴趣的读者可以自行查阅。我之所以使用
ox-publish.el ，主要有以下几点原因：
</p>
</div>
<div id="outline-container-兼容性" class="outline-4">
<h4 id="兼容性"><span class="section-number-4">1.1.1.</span> 兼容性</h4>
<div class="outline-text-4" id="text-兼容性">
<p>
我基本上所有的写作活动都是在 Org-mode 里完成的，对 Org-mode 有着比较深度的自定义配置，因此希望能直接基于 org 文件来生成博客。Hugo 虽然号称能够解析 org 格式，但是对于自定义的格式就无能为力了<sup><label for="fnr.1" class="footref">1</label></sup><input id="fnr.1" class="footref-toggle" type="checkbox">，比如说<a href="https://orgmode.org/manual/Adding-Hyperlink-Types.html">自定义的链接格式</a>。而 ox-publish.el 采用的是 Org-mode 自带的导出功能，只需要你自己写好相关格式的导出方式，便可以完美地支持任何 org 文件。
</p>
</div>
</div>
<div id="outline-container-内置" class="outline-4">
<h4 id="内置"><span class="section-number-4">1.1.2.</span> 内置</h4>
<div class="outline-text-4" id="text-内置">
<p>
ox-publish.el 中的 <code>ox</code> 是 <code>org-export</code> 的缩写，从名字就能看出来它是 Org-mode 导出功能的一个模块。因此可以和 Org-mode 的其他功能功能无缝整合，任何需求都能较为简单地实现。内置的另一个好处是我不用担心这个项目后续的发展，只要 Org-mode 还能用，
ox-publish.el 就能用。
</p>
</div>
</div>
<div id="outline-container-可拓展性" class="outline-4">
<h4 id="可拓展性"><span class="section-number-4">1.1.3.</span> 可拓展性</h4>
<div class="outline-text-4" id="text-可拓展性">
<p>
Org-mode 的 <code>ox</code> 模块提供了很多 hook ，比如能够分别在导出前后修改原始文本（的复制）和导出文本。这基本上满足我的绝大部分个性化需求，实在不行我也可以通过 <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Advising-Functions.html">advice</a> 来修改原有函数，总之可扩展性非常好强。
</p>
</div>
</div>
</div>
<div id="outline-container-blog-structure" class="outline-3">
<h3 id="blog-structure"><span class="section-number-3">1.2.</span> 博客结构</h3>
<div class="outline-text-3" id="text-blog-structure">
<p>
首先介绍一下博客的基本结构
</p>

<pre class="example">
├── articles/
├── config.html
├── css/
│   └── style.css
├── index.html
├── rss.xml
└── scripts/
    └── script.js
    └── toc.js
</pre>

<dl class="org-dl">
<dt>articles</dt><dd>此文件夹包含所有的博客文章</dd>
<dt>css</dt><dd>此文件夹包含所有的 CSS 文件</dd>
<dt>script</dt><dd>此文件夹包含所有的 JS 文件</dd>
<dt>config.html</dt><dd>我的 Emacs 文学编程配置</dd>
<dt>index.html</dt><dd>博客主页</dd>
<dt>rss.xml</dt><dd>RSS 订阅</dd>
</dl>
</div>
</div>
